# -*- coding: utf-8 -*-
print 14183 - 13856
print 19000 / 21.75/2
s3 = 19000 / 21.75 * 5
tax3 = 2870  # 3月份按19000基数的个税数
s_tax = 2280  # 19000全额的公积金
print "3月份应发：", s3
print '3月份实发：', 19000 - 2870
print '4月份工资扣掉五险一金：', 19000 - 226.72 - 88.04 - s_tax
print '4月份应交个税：', 2221.31
s4 = 19000 - 226.72 - 88.04 - s_tax - 2221.31
print '4月份税后工资：', s4
print '3,4两个月分理论总收入：', s3 + s4
s4_sum = s3 + s4 + s_tax * 2
print '-----------3,4两个月加上公积金理论总收入：', s4_sum


c3 = 16130  # 3月份工资入帐额
c4 = 3453.06  # 4月工资入帐额
sum1 = c3 + c4  # 3,4两月入帐总额
print '3,4两月已入帐金额：', sum1

sum1_2 = sum1 + 600 * 2  # 3,4月实际总收入(含公积金)
sum1_2 += 1680  # 补完公积金差额后的实际总收入
print '-----------3,4两个月加上公积金实际总收入：', sum1_2
print '-----------理论与实际收入相差额----------：', s4_sum - sum1_2  # 最终的理论收入与实际收入相差数

s_tax_discount = s_tax - 600  # 假如人事补税成功，将来还需要在我个人部分再扣除的数
print '补交成功后个人部分再扣公积金数：', s_tax_discount
sum2 = sum1 - (s_tax_discount)  # 假如补全公积金且扣余款后（即人事同意我的方案后，将来我的3，4两个月的实际收入金额）
print '3,4月补全公积金后的实际收入：', sum2
print '补全公积金后我的实际收入相差金额：', sum2 - s3 - s4
